import React from "react";
import Header from "./components/header";
import Footer from "./components/footer";
const Main = () => {
  return (
    <div className="container">
      <Header />
      <main className="main">
        <h2>با سلام</h2>
        <h4>
          تسک فنی در نظرگرفته شده یکسری نیازمندی ها دارد که برخی لازم هست که در
          تسک رعایت شود و یکسری هم در صورت استفاده مزیت محسوب میشوند
        </h4>
        <h2>توضیحات تسک:</h2>

        <h4>
          شما قرار است اپلیکیشنی که در اختیارتان گذاشته شده است را به یک فروشگاه
          کاملا ساده که لیست تعدادزیادی محصول را نمایش می دهد تبدیل کنید . تنها
          ویژگی های مد نظر عبارتند از جستجو در بین محصولات با نام محصول ، فیلتر
          مرتب سازی بر اساس نام یا قیمت ، توانایی افزودن محصول به سبد خرید و
          نهایتا مشاهده سبد خرید.
        </h4>

        <h4>
          توجه داشته باشید که از paginate نمیتوانید استفاده کنید و تمامی محصولات
          باید در یک صفحه بارگذاری شوند.
        </h4>
        <h4>برای طراحی قالب میتوانید از فایل pdf ضمیمه شده استفاده کنید</h4>
        <h4>
          فایل حاوی جیسون محصولات ضمیمه ی تسک می باشد و لزومی به گرفتن محصولات
          توسط api نیست
        </h4>

        <hr />

        <h2>نیامندی های تسک</h2>

        <ul>
          <li>
            فایل webpack موجود در این اپلیکیشن نواقصاتی دارد که بنا به نیازمندی
            های تسک آنها را باید تکمیل کنید.
          </li>
          <li>پروژه تماما typescript باشد</li>
          <li>حجم فایل bundle نهایی و پرفورمنس برنامه بسیار مهم میباشد</li>
          <li>از zustand یا redux-toolkit استفاده شود</li>
          <li>
            در طراحی ui فقط مجاز به استفاده از tailwind و css یا scss هستید
          </li>
          <li>تسک باید به صورت docker شده و آماده deploy تحویل داده شود</li>
        </ul>

        <hr />

        <h2>استفاده از موارد زیر مزیت محسوب میشود:</h2>
        <ul>
          <li>استفاده اصول SOLID</li>
          <li>استفاده از دیزاین پترن ها</li>
          <li>نوشتن داکیومنت و تست</li>
          <li>تبدیل spa به ssr</li>
        </ul>
      </main>
      <Footer />
    </div>
  );
};

export default Main;
